use crate::game::rules::Gesture;

// Main Banner - for Main Menu
pub fn main_menu_banner() -> &'static str {
    r#"
████████████████████████████████████████
█    NEON RPS // PROGRAMMING LANGS     █
████████████████████████████████████████
"#
}

// Victory Banner
pub fn winner_banner() -> &'static str {
    r#"
████████████████████████████████████████
█             WINNER!                  █
████████████████████████████████████████
"#
}

// Tie Banner 
pub fn tie_banner() -> &'static str {
    r#"
████████████████████████████████████████
█               TIE                    █
████████████████████████████████████████
"#
}


pub fn section_divider() -> &'static str {
    "────────────────────────────────────────"
}


pub fn ascii_gesture(g: &Gesture) -> &'static str {
    match g {
        Gesture::Rock => r#"[ROCK    🗿]"#,
        Gesture::Paper => r#"[PAPER   📄]"#,
        Gesture::Scissors => r#"[SCISSORS✂️]"#,
        Gesture::Lizard => r#"[LIZARD  🦎]"#,
        Gesture::Spock => r#"[SPOCK   🖖]"#,
    }
}

pub fn move_selection_banner() -> &'static str {
    r#"
████████████████████████████████████████
█            CHOOSE MOVE               █
████████████████████████████████████████
"#
}


